In [89]:
import pandas as pd # library for data analysis
import requests # library to handle requests
from bs4 import BeautifulSoup # library to parse HTML documents

In [90]:
# get the response in the form of html
wikiurl="https://en.wikipedia.org/wiki/List_of_cities_with_the_most_skyscrapers"
table_class="wikitable sortable jquery-tablesorter"
response=requests.get(wikiurl)
print(response.status_code)

200

In [91]:
# parse data from the html into a beautifulsoup object
soup = BeautifulSoup(response.text, 'html.parser')
skyscrapers=soup.find('table',{'class':"wikitable"})

In [92]:
df=pd.read_html(str(skyscrapers))
# convert list to dataframe
df=pd.DataFrame(df[0])
print(df)
data = df

     Rank           City               Country  Image Number of skyscrapers
0       1      Hong Kong                 China    NaN                   503
1       2       Shenzhen                 China    NaN                   332
2       3  New York City         United States    NaN                   296
3       4          Dubai  United Arab Emirates    NaN                   232
4       5       Shanghai                 China    NaN                   175
..    ...            ...                   ...    ...                   ...
97    92=        Colombo             Sri Lanka    NaN                11[13]
98    92=       Dongguan                 China    NaN                    11
99   100=     Pittsburgh         United States    NaN                    10
100  100=       Kawasaki                 Japan    NaN                    10
101  100=        Daejeon           South Korea    NaN                    10

[102 rows x 5 columns]

In [93]:
data.head()

  Rank           City               Country  Image Number of skyscrapers
0    1      Hong Kong                 China    NaN                   503
1    2       Shenzhen                 China    NaN                   332
2    3  New York City         United States    NaN                   296
3    4          Dubai  United Arab Emirates    NaN                   232
4    5       Shanghai                 China    NaN                   175

In [94]:
data = data.drop(["Rank", "Image","Country"], axis=1)
# rename columns for ease
print(data.head())

            City Number of skyscrapers
0      Hong Kong                   503
1       Shenzhen                   332
2  New York City                   296
3          Dubai                   232
4       Shanghai                   175

In [96]:
data.head(10)

              City Number of skyscrapers
0        Hong Kong                   503
1         Shenzhen                   332
2    New York City                   296
3            Dubai                   232
4         Shanghai                   175
..             ...                   ...
97         Colombo                11[13]
98        Dongguan                    11
99      Pittsburgh                    10
100       Kawasaki                    10
101        Daejeon                    10

[102 rows x 2 columns]

In [97]:
data.to_excel("city_skyscrappers_wiki.xlsx")